backend: theano
class_name: Model
config:
  input_layers:
  - [left_features, 0, 0]
  - [central_features, 0, 0]
  - [right_features, 0, 0]
  - [left_metas, 0, 0]
  - [right_metas, 0, 0]
  - [central_metas, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 233]
      dtype: float32
      name: left_features
      sparse: false
    inbound_nodes: []
    name: left_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 22]
      dtype: float32
      name: left_metas
      sparse: false
    inbound_nodes: []
    name: left_metas
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 233]
      dtype: float32
      name: right_features
      sparse: false
    inbound_nodes: []
    name: right_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 22]
      dtype: float32
      name: right_metas
      sparse: false
    inbound_nodes: []
    name: right_metas
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_19, trainable: true}
    inbound_nodes:
    - - - left_features
        - 0
        - 0
        - &id001 {}
      - - left_metas
        - 0
        - 0
        - *id001
    name: concatenate_19
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_20, trainable: true}
    inbound_nodes:
    - - - right_features
        - 0
        - 0
        - &id002 {}
      - - right_metas
        - 0
        - 0
        - *id002
    name: concatenate_20
  - class_name: Dropout
    config: {name: dropout_10, noise_shape: null, rate: 0.2, seed: null, trainable: true}
    inbound_nodes:
    - - - concatenate_19
        - 0
        - 0
        - {}
    name: dropout_10
  - class_name: Dropout
    config: {name: dropout_11, noise_shape: null, rate: 0.2, seed: null, trainable: true}
    inbound_nodes:
    - - - concatenate_20
        - 0
        - 0
        - {}
    name: dropout_11
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 255]
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: embedding_left
          trainable: true
          units: 200
          use_bias: true
      name: time_distributed_7
      trainable: true
    inbound_nodes:
    - - - dropout_10
        - 0
        - 0
        - {}
    name: time_distributed_7
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 255]
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: embedding_right
          trainable: true
          units: 200
          use_bias: true
      name: time_distributed_8
      trainable: true
    inbound_nodes:
    - - - dropout_11
        - 0
        - 0
        - {}
    name: time_distributed_8
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_left_0
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - time_distributed_7
        - 0
        - 0
        - {}
    name: lstm_left_0
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_right_0
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - time_distributed_8
        - 0
        - 0
        - {}
    name: lstm_right_0
  - class_name: Activation
    config: {activation: relu, name: activation_13, trainable: true}
    inbound_nodes:
    - - - lstm_left_0
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 160]
      dtype: float32
      name: central_features
      sparse: false
    inbound_nodes: []
    name: central_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 22]
      dtype: float32
      name: central_metas
      sparse: false
    inbound_nodes: []
    name: central_metas
  - class_name: Activation
    config: {activation: relu, name: activation_14, trainable: true}
    inbound_nodes:
    - - - lstm_right_0
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: Add
    config: {name: add_7, trainable: true}
    inbound_nodes:
    - - - activation_13
        - 0
        - 0
        - &id003 {}
      - - time_distributed_7
        - 0
        - 0
        - *id003
    name: add_7
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_21, trainable: true}
    inbound_nodes:
    - - - central_features
        - 0
        - 0
        - &id004 {}
      - - central_metas
        - 0
        - 0
        - *id004
    name: concatenate_21
  - class_name: Add
    config: {name: add_8, trainable: true}
    inbound_nodes:
    - - - activation_14
        - 0
        - 0
        - &id005 {}
      - - time_distributed_8
        - 0
        - 0
        - *id005
    name: add_8
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_left_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - {}
    name: lstm_left_1
  - class_name: Dropout
    config: {name: dropout_12, noise_shape: null, rate: 0.2, seed: null, trainable: true}
    inbound_nodes:
    - - - concatenate_21
        - 0
        - 0
        - {}
    name: dropout_12
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_right_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - {}
    name: lstm_right_1
  - class_name: Activation
    config: {activation: relu, name: activation_15, trainable: true}
    inbound_nodes:
    - - - lstm_left_1
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple ['4wEAAAAAAAAAAQAAAAUAAABTAAAAcxYAAAB8AGQAZACFAmQCZABkAIUCZgMZAFMAKQNO6QEAAADp

          /////6kAKQHaAXRyAwAAAHIDAAAA+jwvaG9tZS9nYWV0YW4vUHJvamV0cy9QeXRob24vd29ya3Nw

          YWNlL0RlZXBCYWNoL21vZGVsc196b28ucHnaCDxsYW1iZGE+mwAAAPMAAAAA

          ', null, null]
      function_type: lambda
      name: lambda_7
      output_shape: !!python/tuple ['4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQDGQBmAlMAKQRO6QAAAADpAQAAAOn/

          ////qQApAdoLaW5wdXRfc2hhcGVyBAAAAHIEAAAAejwvaG9tZS9nYWV0YW4vUHJvamV0cy9QeXRo

          b24vd29ya3NwYWNlL0RlZXBCYWNoL21vZGVsc196b28ucHnaCDxsYW1iZGE+nAAAAPMAAAAA

          ', null, null]
      output_shape_type: lambda
      trainable: true
    inbound_nodes:
    - - - lstm_left_0
        - 0
        - 0
        - {}
    name: lambda_7
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_10
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - dropout_12
        - 0
        - 0
        - {}
    name: dense_10
  - class_name: Activation
    config: {activation: relu, name: activation_16, trainable: true}
    inbound_nodes:
    - - - lstm_right_1
        - 0
        - 0
        - {}
    name: activation_16
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple ['4wEAAAAAAAAAAQAAAAUAAABTAAAAcxYAAAB8AGQAZACFAmQCZABkAIUCZgMZAFMAKQNO6QEAAADp

          /////6kAKQHaAXRyAwAAAHIDAAAA+jwvaG9tZS9nYWV0YW4vUHJvamV0cy9QeXRob24vd29ya3Nw

          YWNlL0RlZXBCYWNoL21vZGVsc196b28ucHnaCDxsYW1iZGE+ngAAAPMAAAAA

          ', null, null]
      function_type: lambda
      name: lambda_8
      output_shape: !!python/tuple ['4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQDGQBmAlMAKQRO6QAAAADpAQAAAOn/

          ////qQApAdoLaW5wdXRfc2hhcGVyBAAAAHIEAAAAejwvaG9tZS9nYWV0YW4vUHJvamV0cy9QeXRo

          b24vd29ya3NwYWNlL0RlZXBCYWNoL21vZGVsc196b28ucHnaCDxsYW1iZGE+nwAAAPMAAAAA

          ', null, null]
      output_shape_type: lambda
      trainable: true
    inbound_nodes:
    - - - lstm_right_0
        - 0
        - 0
        - {}
    name: lambda_8
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_22, trainable: true}
    inbound_nodes:
    - - - activation_15
        - 0
        - 0
        - &id006 {}
      - - lambda_7
        - 0
        - 0
        - *id006
    name: concatenate_22
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_11
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - dense_10
        - 0
        - 0
        - {}
    name: dense_11
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_23, trainable: true}
    inbound_nodes:
    - - - activation_16
        - 0
        - 0
        - &id007 {}
      - - lambda_8
        - 0
        - 0
        - *id007
    name: concatenate_23
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_24, trainable: true}
    inbound_nodes:
    - - - concatenate_22
        - 0
        - 0
        - &id008 {}
      - - dense_11
        - 0
        - 0
        - *id008
      - - concatenate_23
        - 0
        - 0
        - *id008
    name: concatenate_24
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_12
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - concatenate_24
        - 0
        - 0
        - {}
    name: dense_12
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: pitch_prediction
      trainable: true
      units: 73
      use_bias: true
    inbound_nodes:
    - - - dense_12
        - 0
        - 0
        - {}
    name: pitch_prediction
  name: model_4
  output_layers:
  - [pitch_prediction, 0, 0]
keras_version: 2.2.0
